---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamPermeability
source: html/eb8107c3-c05d-cc2e-2a63-e3bd44fdbf01.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamPermeability Property

"Permeability"

## Syntax (C#)
```csharp
public static ForgeTypeId ThermalMaterialParamPermeability { get; }
```